; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem strips-grid-y-3)
   (:domain grid)
   (:objects node0-0 node0-1 node0-2 node0-3 node0-4 node0-5
             node0-6 node1-0 node1-1 node1-2 node1-3 node1-4 node1-5
             node1-6 node2-0 node2-1 node2-2 node2-3 node2-4 node2-5
             node2-6 node3-0 node3-1 node3-2 node3-3 node3-4 node3-5
             node3-6 node4-0 node4-1 node4-2 node4-3 node4-4 node4-5
             node4-6 node5-0 node5-1 node5-2 node5-3 node5-4 node5-5
             node5-6 node6-0 node6-1 node6-2 node6-3 node6-4 node6-5
             node6-6 triangle diamond square circle key0 key1 key2 key3 key4
             key5 key6 key7 key8 key9 key10)
   (:init (arm-empty)
          (place node0-0)
          (place node0-1)
          (place node0-2)
          (place node0-3)
          (place node0-4)
          (place node0-5)
          (place node0-6)
          (place node1-0)
          (place node1-1)
          (place node1-2)
          (place node1-3)
          (place node1-4)
          (place node1-5)
          (place node1-6)
          (place node2-0)
          (place node2-1)
          (place node2-2)
          (place node2-3)
          (place node2-4)
          (place node2-5)
          (place node2-6)
          (place node3-0)
          (place node3-1)
          (place node3-2)
          (place node3-3)
          (place node3-4)
          (place node3-5)
          (place node3-6)
          (place node4-0)
          (place node4-1)
          (place node4-2)
          (place node4-3)
          (place node4-4)
          (place node4-5)
          (place node4-6)
          (place node5-0)
          (place node5-1)
          (place node5-2)
          (place node5-3)
          (place node5-4)
          (place node5-5)
          (place node5-6)
          (place node6-0)
          (place node6-1)
          (place node6-2)
          (place node6-3)
          (place node6-4)
          (place node6-5)
          (place node6-6)
          (shape triangle)
          (shape diamond)
          (shape square)
          (shape circle)
          (conn node0-0 node1-0)
          (conn node0-0 node0-1)
          (conn node0-1 node1-1)
          (conn node0-1 node0-2)
          (conn node0-1 node0-0)
          (conn node0-2 node1-2)
          (conn node0-2 node0-3)
          (conn node0-2 node0-1)
          (conn node0-3 node1-3)
          (conn node0-3 node0-4)
          (conn node0-3 node0-2)
          (conn node0-4 node1-4)
          (conn node0-4 node0-5)
          (conn node0-4 node0-3)
          (conn node0-5 node1-5)
          (conn node0-5 node0-6)
          (conn node0-5 node0-4)
          (conn node0-6 node1-6)
          (conn node0-6 node0-5)
          (conn node1-0 node2-0)
          (conn node1-0 node0-0)
          (conn node1-0 node1-1)
          (conn node1-1 node2-1)
          (conn node1-1 node0-1)
          (conn node1-1 node1-2)
          (conn node1-1 node1-0)
          (conn node1-2 node2-2)
          (conn node1-2 node0-2)
          (conn node1-2 node1-3)
          (conn node1-2 node1-1)
          (conn node1-3 node2-3)
          (conn node1-3 node0-3)
          (conn node1-3 node1-4)
          (conn node1-3 node1-2)
          (conn node1-4 node2-4)
          (conn node1-4 node0-4)
          (conn node1-4 node1-5)
          (conn node1-4 node1-3)
          (conn node1-5 node2-5)
          (conn node1-5 node0-5)
          (conn node1-5 node1-6)
          (conn node1-5 node1-4)
          (conn node1-6 node2-6)
          (conn node1-6 node0-6)
          (conn node1-6 node1-5)
          (conn node2-0 node3-0)
          (conn node2-0 node1-0)
          (conn node2-0 node2-1)
          (conn node2-1 node3-1)
          (conn node2-1 node1-1)
          (conn node2-1 node2-2)
          (conn node2-1 node2-0)
          (conn node2-2 node3-2)
          (conn node2-2 node1-2)
          (conn node2-2 node2-3)
          (conn node2-2 node2-1)
          (conn node2-3 node3-3)
          (conn node2-3 node1-3)
          (conn node2-3 node2-4)
          (conn node2-3 node2-2)
          (conn node2-4 node3-4)
          (conn node2-4 node1-4)
          (conn node2-4 node2-5)
          (conn node2-4 node2-3)
          (conn node2-5 node3-5)
          (conn node2-5 node1-5)
          (conn node2-5 node2-6)
          (conn node2-5 node2-4)
          (conn node2-6 node3-6)
          (conn node2-6 node1-6)
          (conn node2-6 node2-5)
          (conn node3-0 node4-0)
          (conn node3-0 node2-0)
          (conn node3-0 node3-1)
          (conn node3-1 node4-1)
          (conn node3-1 node2-1)
          (conn node3-1 node3-2)
          (conn node3-1 node3-0)
          (conn node3-2 node4-2)
          (conn node3-2 node2-2)
          (conn node3-2 node3-3)
          (conn node3-2 node3-1)
          (conn node3-3 node4-3)
          (conn node3-3 node2-3)
          (conn node3-3 node3-4)
          (conn node3-3 node3-2)
          (conn node3-4 node4-4)
          (conn node3-4 node2-4)
          (conn node3-4 node3-5)
          (conn node3-4 node3-3)
          (conn node3-5 node4-5)
          (conn node3-5 node2-5)
          (conn node3-5 node3-6)
          (conn node3-5 node3-4)
          (conn node3-6 node4-6)
          (conn node3-6 node2-6)
          (conn node3-6 node3-5)
          (conn node4-0 node5-0)
          (conn node4-0 node3-0)
          (conn node4-0 node4-1)
          (conn node4-1 node5-1)
          (conn node4-1 node3-1)
          (conn node4-1 node4-2)
          (conn node4-1 node4-0)
          (conn node4-2 node5-2)
          (conn node4-2 node3-2)
          (conn node4-2 node4-3)
          (conn node4-2 node4-1)
          (conn node4-3 node5-3)
          (conn node4-3 node3-3)
          (conn node4-3 node4-4)
          (conn node4-3 node4-2)
          (conn node4-4 node5-4)
          (conn node4-4 node3-4)
          (conn node4-4 node4-5)
          (conn node4-4 node4-3)
          (conn node4-5 node5-5)
          (conn node4-5 node3-5)
          (conn node4-5 node4-6)
          (conn node4-5 node4-4)
          (conn node4-6 node5-6)
          (conn node4-6 node3-6)
          (conn node4-6 node4-5)
          (conn node5-0 node6-0)
          (conn node5-0 node4-0)
          (conn node5-0 node5-1)
          (conn node5-1 node6-1)
          (conn node5-1 node4-1)
          (conn node5-1 node5-2)
          (conn node5-1 node5-0)
          (conn node5-2 node6-2)
          (conn node5-2 node4-2)
          (conn node5-2 node5-3)
          (conn node5-2 node5-1)
          (conn node5-3 node6-3)
          (conn node5-3 node4-3)
          (conn node5-3 node5-4)
          (conn node5-3 node5-2)
          (conn node5-4 node6-4)
          (conn node5-4 node4-4)
          (conn node5-4 node5-5)
          (conn node5-4 node5-3)
          (conn node5-5 node6-5)
          (conn node5-5 node4-5)
          (conn node5-5 node5-6)
          (conn node5-5 node5-4)
          (conn node5-6 node6-6)
          (conn node5-6 node4-6)
          (conn node5-6 node5-5)
          (conn node6-0 node5-0)
          (conn node6-0 node6-1)
          (conn node6-1 node5-1)
          (conn node6-1 node6-2)
          (conn node6-1 node6-0)
          (conn node6-2 node5-2)
          (conn node6-2 node6-3)
          (conn node6-2 node6-1)
          (conn node6-3 node5-3)
          (conn node6-3 node6-4)
          (conn node6-3 node6-2)
          (conn node6-4 node5-4)
          (conn node6-4 node6-5)
          (conn node6-4 node6-3)
          (conn node6-5 node5-5)
          (conn node6-5 node6-6)
          (conn node6-5 node6-4)
          (conn node6-6 node5-6)
          (conn node6-6 node6-5)
          (locked node5-3)
          (lock-shape node5-3 diamond)
          (locked node5-4)
          (lock-shape node5-4 diamond)
          (locked node4-4)
          (lock-shape node4-4 diamond)
          (locked node4-3)
          (lock-shape node4-3 diamond)
          (locked node3-3)
          (lock-shape node3-3 diamond)
          (locked node2-3)
          (lock-shape node2-3 diamond)
          (locked node2-2)
          (lock-shape node2-2 diamond)
          (locked node3-2)
          (lock-shape node3-2 diamond)
          (locked node4-2)
          (lock-shape node4-2 diamond)
          (locked node5-2)
          (lock-shape node5-2 diamond)
          (open node0-0)
          (open node0-1)
          (open node0-2)
          (open node0-3)
          (open node0-4)
          (open node0-5)
          (open node0-6)
          (open node1-0)
          (open node1-1)
          (open node1-2)
          (open node1-3)
          (open node1-4)
          (open node1-5)
          (open node1-6)
          (open node2-0)
          (open node2-1)
          (open node2-4)
          (open node2-5)
          (open node2-6)
          (open node3-0)
          (open node3-1)
          (open node3-4)
          (open node3-5)
          (open node3-6)
          (open node4-0)
          (open node4-1)
          (open node4-5)
          (open node4-6)
          (open node5-0)
          (open node5-1)
          (open node5-5)
          (open node5-6)
          (open node6-0)
          (open node6-1)
          (open node6-2)
          (open node6-3)
          (open node6-4)
          (open node6-5)
          (open node6-6)
          (key key0)
          (key-shape key0 diamond)
          (at key0 node1-4)
          (key key1)
          (key-shape key1 triangle)
          (at key1 node2-4)
          (key key2)
          (key-shape key2 circle)
          (at key2 node3-2)
          (key key3)
          (key-shape key3 square)
          (at key3 node0-2)
          (key key4)
          (key-shape key4 square)
          (at key4 node2-4)
          (key key5)
          (key-shape key5 circle)
          (at key5 node4-3)
          (key key6)
          (key-shape key6 triangle)
          (at key6 node1-5)
          (key key7)
          (key-shape key7 square)
          (at key7 node3-0)
          (key key8)
          (key-shape key8 diamond)
          (at key8 node2-2)
          (key key9)
          (key-shape key9 square)
          (at key9 node1-4)
          (key key10)
          (key-shape key10 triangle)
          (at key10 node1-1)
          (at-robot node3-4))
   (:goal (and (at key2 node0-5)
               (at key0 node0-5)
               (at key4 node5-6)
               (at key9 node1-0)
               (at key1 node4-6))))

; plan
1. (move node3-4 node2-4)
   deleted: (at-robot node3-4)
   added: (at-robot node2-4)
   goals met: 0 of 5
2. (pickup node2-4 key1)
   deleted: (at key1 node2-4) (arm-empty)
   added: (holding key1)
   goals met: 0 of 5
3. (pickup-and-loose node2-4 key4 key1)
   deleted: (holding key1) (at key4 node2-4)
   added: (holding key4) (at key1 node2-4)
   goals met: 0 of 5
4. (move node2-4 node1-4)
   deleted: (at-robot node2-4)
   added: (at-robot node1-4)
   goals met: 0 of 5
5. (move node1-4 node1-3)
   deleted: (at-robot node1-4)
   added: (at-robot node1-3)
   goals met: 0 of 5
6. (move node1-3 node1-2)
   deleted: (at-robot node1-3)
   added: (at-robot node1-2)
   goals met: 0 of 5
7. (move node1-2 node1-1)
   deleted: (at-robot node1-2)
   added: (at-robot node1-1)
   goals met: 0 of 5
8. (move node1-1 node1-0)
   deleted: (at-robot node1-1)
   added: (at-robot node1-0)
   goals met: 0 of 5
9. (move node1-0 node2-0)
   deleted: (at-robot node1-0)
   added: (at-robot node2-0)
   goals met: 0 of 5
10. (move node2-0 node3-0)
   deleted: (at-robot node2-0)
   added: (at-robot node3-0)
   goals met: 0 of 5
11. (move node3-0 node3-1)
   deleted: (at-robot node3-0)
   added: (at-robot node3-1)
   goals met: 0 of 5
12. (move node3-1 node4-1)
   deleted: (at-robot node3-1)
   added: (at-robot node4-1)
   goals met: 0 of 5
13. (move node4-1 node5-1)
   deleted: (at-robot node4-1)
   added: (at-robot node5-1)
   goals met: 0 of 5
14. (move node5-1 node6-1)
   deleted: (at-robot node5-1)
   added: (at-robot node6-1)
   goals met: 0 of 5
15. (move node6-1 node6-2)
   deleted: (at-robot node6-1)
   added: (at-robot node6-2)
   goals met: 0 of 5
16. (move node6-2 node6-3)
   deleted: (at-robot node6-2)
   added: (at-robot node6-3)
   goals met: 0 of 5
17. (move node6-3 node6-4)
   deleted: (at-robot node6-3)
   added: (at-robot node6-4)
   goals met: 0 of 5
18. (move node6-4 node6-5)
   deleted: (at-robot node6-4)
   added: (at-robot node6-5)
   goals met: 0 of 5
19. (move node6-5 node5-5)
   deleted: (at-robot node6-5)
   added: (at-robot node5-5)
   goals met: 0 of 5
20. (move node5-5 node5-6)
   deleted: (at-robot node5-5)
   added: (at-robot node5-6)
   goals met: 0 of 5
21. (putdown node5-6 key4)
   deleted: (holding key4)
   added: (arm-empty) (at key4 node5-6)
   goals met: 1 of 5
22. (move node5-6 node4-6)
   deleted: (at-robot node5-6)
   added: (at-robot node4-6)
   goals met: 1 of 5
23. (move node4-6 node3-6)
   deleted: (at-robot node4-6)
   added: (at-robot node3-6)
   goals met: 1 of 5
24. (move node3-6 node2-6)
   deleted: (at-robot node3-6)
   added: (at-robot node2-6)
   goals met: 1 of 5
25. (move node2-6 node1-6)
   deleted: (at-robot node2-6)
   added: (at-robot node1-6)
   goals met: 1 of 5
26. (move node1-6 node1-5)
   deleted: (at-robot node1-6)
   added: (at-robot node1-5)
   goals met: 1 of 5
27. (move node1-5 node1-4)
   deleted: (at-robot node1-5)
   added: (at-robot node1-4)
   goals met: 1 of 5
28. (pickup node1-4 key0)
   deleted: (at key0 node1-4) (arm-empty)
   added: (holding key0)
   goals met: 1 of 5
29. (move node1-4 node2-4)
   deleted: (at-robot node1-4)
   added: (at-robot node2-4)
   goals met: 1 of 5
30. (move node2-4 node3-4)
   deleted: (at-robot node2-4)
   added: (at-robot node3-4)
   goals met: 1 of 5
31. (unlock node3-4 node3-3 key0 diamond)
   deleted: (locked node3-3)
   added: (open node3-3)
   goals met: 1 of 5
32. (move node3-4 node3-3)
   deleted: (at-robot node3-4)
   added: (at-robot node3-3)
   goals met: 1 of 5
33. (unlock node3-3 node3-2 key0 diamond)
   deleted: (locked node3-2)
   added: (open node3-2)
   goals met: 1 of 5
34. (move node3-3 node3-2)
   deleted: (at-robot node3-3)
   added: (at-robot node3-2)
   goals met: 1 of 5
35. (pickup-and-loose node3-2 key2 key0)
   deleted: (holding key0) (at key2 node3-2)
   added: (holding key2) (at key0 node3-2)
   goals met: 1 of 5
36. (move node3-2 node3-3)
   deleted: (at-robot node3-2)
   added: (at-robot node3-3)
   goals met: 1 of 5
37. (move node3-3 node3-4)
   deleted: (at-robot node3-3)
   added: (at-robot node3-4)
   goals met: 1 of 5
38. (move node3-4 node2-4)
   deleted: (at-robot node3-4)
   added: (at-robot node2-4)
   goals met: 1 of 5
39. (move node2-4 node1-4)
   deleted: (at-robot node2-4)
   added: (at-robot node1-4)
   goals met: 1 of 5
40. (move node1-4 node1-5)
   deleted: (at-robot node1-4)
   added: (at-robot node1-5)
   goals met: 1 of 5
41. (move node1-5 node0-5)
   deleted: (at-robot node1-5)
   added: (at-robot node0-5)
   goals met: 1 of 5
42. (putdown node0-5 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 node0-5)
   goals met: 2 of 5
43. (move node0-5 node0-4)
   deleted: (at-robot node0-5)
   added: (at-robot node0-4)
   goals met: 2 of 5
44. (move node0-4 node1-4)
   deleted: (at-robot node0-4)
   added: (at-robot node1-4)
   goals met: 2 of 5
45. (pickup node1-4 key9)
   deleted: (at key9 node1-4) (arm-empty)
   added: (holding key9)
   goals met: 2 of 5
46. (move node1-4 node2-4)
   deleted: (at-robot node1-4)
   added: (at-robot node2-4)
   goals met: 2 of 5
47. (pickup-and-loose node2-4 key1 key9)
   deleted: (holding key9) (at key1 node2-4)
   added: (holding key1) (at key9 node2-4)
   goals met: 2 of 5
48. (move node2-4 node3-4)
   deleted: (at-robot node2-4)
   added: (at-robot node3-4)
   goals met: 2 of 5
49. (move node3-4 node3-5)
   deleted: (at-robot node3-4)
   added: (at-robot node3-5)
   goals met: 2 of 5
50. (move node3-5 node4-5)
   deleted: (at-robot node3-5)
   added: (at-robot node4-5)
   goals met: 2 of 5
51. (move node4-5 node4-6)
   deleted: (at-robot node4-5)
   added: (at-robot node4-6)
   goals met: 2 of 5
52. (putdown node4-6 key1)
   deleted: (holding key1)
   added: (arm-empty) (at key1 node4-6)
   goals met: 3 of 5
53. (move node4-6 node4-5)
   deleted: (at-robot node4-6)
   added: (at-robot node4-5)
   goals met: 3 of 5
54. (move node4-5 node3-5)
   deleted: (at-robot node4-5)
   added: (at-robot node3-5)
   goals met: 3 of 5
55. (move node3-5 node3-4)
   deleted: (at-robot node3-5)
   added: (at-robot node3-4)
   goals met: 3 of 5
56. (move node3-4 node2-4)
   deleted: (at-robot node3-4)
   added: (at-robot node2-4)
   goals met: 3 of 5
57. (pickup node2-4 key9)
   deleted: (at key9 node2-4) (arm-empty)
   added: (holding key9)
   goals met: 3 of 5
58. (move node2-4 node1-4)
   deleted: (at-robot node2-4)
   added: (at-robot node1-4)
   goals met: 3 of 5
59. (move node1-4 node1-3)
   deleted: (at-robot node1-4)
   added: (at-robot node1-3)
   goals met: 3 of 5
60. (move node1-3 node1-2)
   deleted: (at-robot node1-3)
   added: (at-robot node1-2)
   goals met: 3 of 5
61. (move node1-2 node1-1)
   deleted: (at-robot node1-2)
   added: (at-robot node1-1)
   goals met: 3 of 5
62. (move node1-1 node1-0)
   deleted: (at-robot node1-1)
   added: (at-robot node1-0)
   goals met: 3 of 5
63. (putdown node1-0 key9)
   deleted: (holding key9)
   added: (arm-empty) (at key9 node1-0)
   goals met: 4 of 5
64. (move node1-0 node1-1)
   deleted: (at-robot node1-0)
   added: (at-robot node1-1)
   goals met: 4 of 5
65. (move node1-1 node2-1)
   deleted: (at-robot node1-1)
   added: (at-robot node2-1)
   goals met: 4 of 5
66. (move node2-1 node3-1)
   deleted: (at-robot node2-1)
   added: (at-robot node3-1)
   goals met: 4 of 5
67. (move node3-1 node3-2)
   deleted: (at-robot node3-1)
   added: (at-robot node3-2)
   goals met: 4 of 5
68. (pickup node3-2 key0)
   deleted: (at key0 node3-2) (arm-empty)
   added: (holding key0)
   goals met: 4 of 5
69. (move node3-2 node3-3)
   deleted: (at-robot node3-2)
   added: (at-robot node3-3)
   goals met: 4 of 5
70. (move node3-3 node3-4)
   deleted: (at-robot node3-3)
   added: (at-robot node3-4)
   goals met: 4 of 5
71. (move node3-4 node2-4)
   deleted: (at-robot node3-4)
   added: (at-robot node2-4)
   goals met: 4 of 5
72. (move node2-4 node1-4)
   deleted: (at-robot node2-4)
   added: (at-robot node1-4)
   goals met: 4 of 5
73. (move node1-4 node1-5)
   deleted: (at-robot node1-4)
   added: (at-robot node1-5)
   goals met: 4 of 5
74. (move node1-5 node0-5)
   deleted: (at-robot node1-5)
   added: (at-robot node0-5)
   goals met: 4 of 5
75. (putdown node0-5 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 node0-5)
   goals met: 5 of 5
